cask_args appdir: "/Applications"

tap "dart-lang/dart"
tap "homebrew/bundle"
tap "jorgelbg/tap"
tap "k1low/tap"
tap "leoafarias/fvm"
tap "oven-sh/bun"
tap "sidneys/homebrew"
tap "siketyan/tap"
tap "supabase/tap"

brew "eza"
brew "git"
brew "automake"
brew "deno"
brew "fish"
brew "gcc"
brew "gdb"
brew "libmagic"
brew "sqlite"
brew "ssh-copy-id"
brew "jq"
brew "rsync"
brew "wget"
brew "tree"
brew "watch"
brew "peco"

cask "android-platform-tools"
cask "dbeaver-community"
cask "discord"
cask "inkscape"
cask "iterm2"
cask "copilot-for-xcode"
cask "fig"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "google-chrome"
cask "google-chrome-canary"
cask "google-drive"
cask "slack"
cask "spotify"
cask "unity"
cask "vlc"
cask "zoom"
cask "rectangle"
cask "skitch"
cask "raycast"